land-backend/app/serializers/user_serializer.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 44]]
---
    attribute :favorites_listings do |object|
      new_array=[]

      object.favorites.all.each do |object|