land-backend/app/controllers/api/v1/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        favorite= Favorite.find(params[:id])

SELECT "favorites".* FROM "favorites"
---
    def index
        favorites = Favorite.all

INSERT INTO "favorites" ("user_id", "listing_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 26], ["listing_id", 1], ["created_at", "2020-11-21 23:14:41.581341"], ["updated_at", "2020-11-21 23:14:41.581341"]]
---
    def create
        favorite= Favorite.create(favorite_params)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 35]]
---
    def destroy
        favorite=Favorite.find(params[:id])
        favorite.destroy