land-backend/app/controllers/api/v1/listings_controller.rb

SELECT "listings".* FROM "listings"
---
    def index
        listings = Listing.all

SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        listing = Listing.find(params[:id])

INSERT INTO "listings" ("img1", "img2", "img3", "price", "acres", "location", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
        listing= Listing.create(listing_params)

SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "listings" SET "price" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["price", "Sold"], ["updated_at", "2020-12-01 01:36:24.555740"], ["id", 18]]
---
    def update

        listing = Listing.find(params[:id])
        new_price =  params[:price]
        listing.update(price: new_price)