land-backend/app/controllers/api/v1/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("name", "username", "password_digest", "userImg", "phone", "location", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"